#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/davinci/sagemaker-stop-all-apps-lambda/runs/run-2xiNwrkUg8BzUMkt

Waiting for the plan to start...

Terraform v1.7.1
on linux_amd64
Initializing plugins and modules...
data.archive_file.python_lambda_package: Refreshing...
data.archive_file.python_lambda_package: Refresh complete after 0s [id=518618d6b85dab80ca7aa5c5da7d662206096383]
data.aws_iam_policy_document.lambda: Refreshing...
data.aws_iam_policy_document.lambda: Refresh complete after 0s [id=3542763303]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/sagemaker_stop_all_apps"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = {
          + "GitHubRepo" = "sagemaker-stop-all-apps-lambda"
          + "Workspace"  = "sagemaker-stop-all-apps-lambda"
        }
    }

  # aws_cloudwatch_metric_alarm.lambda_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "lambda_alarm" {
      + actions_enabled                       = true
      + alarm_description                     = "Lambda Errored Out"
      + alarm_name                            = "sagemaker_stop_all_apps-lambda-error"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "sagemaker_stop_all_apps"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = {
          + "GitHubRepo" = "sagemaker-stop-all-apps-lambda"
          + "Workspace"  = "sagemaker-stop-all-apps-lambda"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_iam_policy.iam_policy_for_lambda will be created
  + resource "aws_iam_policy" "iam_policy_for_lambda" {
      + arn         = (known after apply)
      + description = "AWS IAM Policy for managing aws lambda role"
      + id          = (known after apply)
      + name        = "sagemaker_stop_all_apps-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "sagemaker:ListApps",
                          + "sagemaker:DeleteApp",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sagemaker:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "GitHubRepo" = "sagemaker-stop-all-apps-lambda"
          + "Workspace"  = "sagemaker-stop-all-apps-lambda"
        }
    }

  # aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = "AllowFromLambda"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sagemaker_stop_all_apps-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "GitHubRepo" = "sagemaker-stop-all-apps-lambda"
          + "Workspace"  = "sagemaker-stop-all-apps-lambda"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_iam_policy_to_iam_role will be created
  + resource "aws_iam_role_policy_attachment" "attach_iam_policy_to_iam_role" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sagemaker_stop_all_apps-role"
    }

  # aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Dumb lambda function utilizing x-ray tracing layer"
      + filename                       = "lambda.zip"
      + function_name                  = "sagemaker_stop_all_apps"
      + handler                        = "handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "n2pkHQRebW95z/hm3pLAs2n+bYpqN1vzp7Ws8tXGedw="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "GitHubRepo" = "sagemaker-stop-all-apps-lambda"
          + "Workspace"  = "sagemaker-stop-all-apps-lambda"
        }
      + timeout                        = 10
      + version                        = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @jmeisele, Action: `pull_request`*